import pandas as pd

data ={
    "ФИО ученика" : ["Московой Тимур", "Ромашов Роман", "Лачугин Майкл", "Юрьев Денис", "Слепушкин Роман", "Andrew NikePro"],
    "Тема 1: Черемша " : [4, 5, 3, 2, 6, 5],
    "Тема 2: Репование " : [3, 3, 5, 3, 3, 5],
    "Тема 3: Моггинг" : [5, 3, 3, 3, 4, 5],
    "Тема 4: Счёт до 67" : [2, 4, 2, 1, 3, 5],
    "Тема 5: Бебраведение " : [4, 5, 3, 4, 3, 5]

}

df = pd.DataFrame(data)
df.to_excel("Journal_mock.xlsx", index =False)
print("Файл 'Journal_mock.xlsx' успешно создан!")